Repository: jett220201/TrainingTracker
Catalog: TrainingTracker.Localization/Resources/Services/ExercisesServiceResource.*.resx
Languages: es

# Arms_BarbellCurl_Description
source: Elbow flexion with a barbell from the waist to the chest.
es: Flexión de codo con barra desde la cintura hasta el pecho.

# Arms_BarbellCurl_Name
source: Barbell Curl
es: Curl con barra

# Arms_ConcentrationCurl_Description
source: Performed while seated, with the elbow resting on the leg for a more controlled movement.
es: Se realiza sentado, con el codo apoyado en la pierna para un movimiento más controlado.

# Arms_ConcentrationCurl_Name
source: Concentration Curl
es: Curl de concentración

# Arms_HammerCurl_Description
source: With dumbbells held vertically, flex the arms.
es: Con las mancuernas en posición vertical, flexiona los brazos.

# Arms_HammerCurl_Name
source: Hammer Curl
es: Curl con mancuernas

# Arms_OverheadTricepsExtension_Description
source: With a dumbbell or bar behind your head, extend your elbows upward.
es: Con una mancuerna o barra detrás de la cabeza, extiende los codos hacia arriba.

# Arms_OverheadTricepsExtension_Name
source: Overhead Triceps Extension
es: Extensión de tríceps por encima de la cabeza

# Arms_TricepDips_Description
source: Lower your body between two bars or with the support of a bench, using your triceps.
es: Baja el cuerpo entre dos barras o con el apoyo de un banco, utilizando los tríceps.

# Arms_TricepDips_Name
source: Tricep Dips
es: Fondos de tríceps

# Arms_TricepsPushdown_Description
source: With a high pulley and rope or bar, push down by extending your elbows.
es: Con una polea alta y una cuerda o barra, empuja hacia abajo extendiendo los codos.

# Arms_TricepsPushdown_Name
source: Triceps Pushdown
es: Extensión de tríceps

# Back_BarbellRow_Description
source: Row a barbell toward your abdomen with your torso inclined, working your middle and lower back.
es: Remar con una barra hacia el abdomen con el torso inclinado, trabajando la parte media y baja de la espalda.

# Back_BarbellRow_Name
source: Barbell Row
es: Remo con barra

# Back_LatPulldown_Description
source: Pull a bar from above to your chest, ideal for your back muscles if you can't do pull-ups.
es: Tira de una barra desde arriba hacia tu pecho, ideal para los músculos de la espalda si no puedes hacer dominadas.

# Back_LatPulldown_Name
source: Lat Pulldown
es: Tirón lateral

# Back_PullUps_Description
source: Hang from a bar and lift your body with your arms, activating your back muscles, biceps, and trapezius muscles.
es: Cuélgate de una barra y levanta tu cuerpo con los brazos, activando los músculos de la espalda, los bíceps y los trapecios.

# Back_PullUps_Name
source: Pull-Ups
es: Dominadas

# Back_SeatedCableRow_Description
source: Sitting down, pull a pulley with both hands toward your abdomen.
es: Sentado, tira de una polea con ambas manos hacia tu abdomen.

# Back_SeatedCableRow_Name
source: Seated Cable Row
es: Remo sentado con cable

# Chest_BenchPress_Description
source: A compound exercise where you push a weighted barbell upward from your chest, working your pectorals, triceps, and shoulders.
es: Ejercicio compuesto en el que se empuja una barra con peso hacia arriba desde el pecho, trabajando los pectorales, tríceps y hombros.

# Chest_BenchPress_Name
source: Bench Press
es: Press de banca

# Chest_ChestFly_Name
source: Chest Fly
es: Aperturas de pecho

# Chest_ChestFly_Description
source: Using dumbbells or a machine, you open and close your arms as if hugging a tree, focusing on the pectorals.
es: Con mancuernas o una máquina, se abren y cierran los brazos como si se abrazara un árbol, centrándose en los pectorales.

# Chest_InclineDumbbellPress_Description
source: Similar to the bench press, but on an incline bench to emphasize the upper chest.
es: Similar al press de banca, pero en un banco inclinado para enfatizar la parte superior del pecho.

# Chest_InclineDumbbellPress_Name
source: Incline Dumbbell Press
es: Press inclinado con mancuernas

# Chest_PushUp_Description
source: Using your body weight, you lower and raise your torso from the floor, activating your chest, triceps, and core.
es: Utilizando el peso de tu cuerpo, bajas y subes el torso desde el suelo, activando el pecho, los tríceps y el tronco.

# Chest_PushUp_Name
source: Push Up
es: Flexiones

# Core_Crunches_Description
source: Partial elevation of the torso from the floor.
es: Elevación parcial del torso desde el suelo.

# Core_Crunches_Name
source: Crunches
es: Abdominales

# Core_LegRaises_Description
source: Controlled elevation of the legs while lying down to work the lower abdominals.
es: Elevación controlada de las piernas mientras se está acostado para trabajar los abdominales inferiores.

# Core_LegRaises_Name
source: Leg Raises
es: Elevaciones de piernas

# Core_Plank_Description
source: Static position supported on elbows and feet, activates the entire core.
es: Posición estática apoyada sobre los codos y los pies, activa todo el tronco.

# Core_Plank_Name
source: Plank
es: Plancha

# Core_RussianTwists_Description
source: Sitting on the floor, rotate the torso from side to side with or without weight.
es: Sentado en el suelo, gira el torso de lado a lado con o sin peso.

# Core_RussianTwists_Name
source: Russian Twists
es: Giros rusos

# ExerciseEmptyName
source: The exercise name cannot be null or empty.
es: El nombre del ejercicio no puede ser nulo o vacío.

# ExerciseUniqueNameMuscleGroupValidation
source: An exercise with the same name {0} and muscle group {1} already exists.
es: Un ejercicio con el mismo nombre {0} y grupo de musculo {1} ya existe.

# Legs_LegCurl_Description
source: On a machine, bend your legs toward your glutes to work your hamstrings.
es: En una máquina, flexiona las piernas hacia los glúteos para trabajar los isquiotibiales.

# Legs_LegCurl_Name
source: Leg Curl
es: Flexión de piernas

# Legs_LegPress_Description
source: On a machine, platforms are pushed with the legs against resistance.
es: En una máquina, se empujan las plataformas con las piernas contra la resistencia.

# Legs_LegPress_Name
source: Leg Press
es: Prensa de piernas

# Legs_Lunges_Description
source: Take a long step forward or backward, lowering your knee, working your quadriceps, glutes, and stability.
es: Da un paso largo hacia delante o hacia atrás, bajando la rodilla, trabajando los cuádriceps, los glúteos y la estabilidad.

# Legs_Lunges_Name
source: Lunges
es: Zancadas

# Legs_Squats_Description
source: Controlled lowering of the body from a standing position to a squatting position, working the quadriceps, glutes, and core.
es: Descenso controlado del cuerpo desde una posición de pie a una posición en cuclillas, trabajando los cuádriceps, los glúteos y el tronco.

# Legs_Squats_Name
source: Squats
es: Sentadillas

# Shoulders_FrontRaises_Description
source: Lift dumbbells in front of you to work the anterior deltoids.
es: Levanta las mancuernas delante de ti para trabajar los deltoides anteriores.

# Shoulders_FrontRaises_Name
source: Front Raises
es: Elevaciones frontales

# Shoulders_LateralRaises_Description
source: Lift dumbbells to the sides to work the lateral deltoid.
es: Levanta las mancuernas hacia los lados para trabajar el deltoides lateral.

# Shoulders_LateralRaises_Name
source: Lateral Raises
es: Elevaciones laterales

# Shoulders_ShoulderPress_Description
source: Using a barbell or dumbbells, push the weight above your head from your shoulders.
es: Con una barra o mancuernas, empuja el peso por encima de la cabeza desde los hombros.

# Shoulders_ShoulderPress_Name
source: Shoulder Press
es: Press de hombros
