Repository: jett220201/TrainingTracker
Catalog: TrainingTracker.Localization/Resources/Shared/SharedResources.*.resx
Languages: es

# AccountLocked
source: Account locked. Try again after {0}.
es: Cuenta bloqueada. Intenta de nuevo después de {0}.

# ErrorWhileProcessing
source: An error occurred while processing your request.
es: Ha ocurrido un error mientras procesábamos tu petición.

# InvalidRefreshToken
source: Invalid or expired refresh token.
es: El token de refresco es inválido o está vencido.

# InvalidUsernamePassword
source: Invalid username or password.
es: Nombre de usuario o contraseña invalida.

# LoggingError
source: An error occurred while logging in.
es: Ha ocurrido un error durante el inicio de sesión.

# SuccessOperation
source: Operation completed successfully.
es: La operación se ha completo exitosamente.

# UnauthAccess
source: Unauthorized access.
es: Acceso denegado.

source: Validation failed.
es: La validación falló.

source: User not found.
es: Usuario no encontrado.

# LoggedOutSuccess
source: Logged out successfully.
es: Se ha cerrado la sesión exitosamente.

# UserRegisterSuccess
source: User registered successfully.
es: Usuario registrado exitosamente.

# UserRegisterError
source: An error occurred while registering the user.
es: Ha ocurrido un error mientras se realizaba el registro del usuario.

# PasswordChangeSuccess
source: Password changed successfully.
es: La contraseña ha sido cambiada exitosamente.

# PasswordChangeError
source: An error occurred while changing the password.
es: Ha ocurrido un error mientras se realizaba el cambio de contraseña.

# PasswordRecoveryEmailSuccess
source: Password recovery email sent successfully.
es: Se ha enviado un correo con la recuperación de la contraseña exitosamente.

# PasswordRecoveryEmailError
source: An error occurred while recovering the password.
es: Ha ocurrido un error mientras se recuperaba la contraseña.

# DeleteAccountSuccess
source: Account deleted successfully.
es: Cuenta eliminada exitosamente.

# DeleteAccountError
source: An error occurred while deleting the account.
es: Ha ocurrido un error mientras se eliminaba la cuenta.

# AddExerciseSuccess
source: Exercise added successfully.
es: El ejercicio ha sido agregado exitosamente.

# AddExerciseError
source: An error occurred while adding the exercise.
es: Ha ocurrido un error mientras se agregaba el ejercicio.

# AddUserGoalSuccess
source: Goal added successfully.
es: La meta ha sido agregada exitosamente.

# AddUserGoalError
source: An error occurred while adding the goal.
es: Ha ocurrido un error mientras se agregaba la meta.

# DeleteUserGoalSuccess
source: Goal deleted successfully.
es: La meta ha sido eliminada exitosamente.

# DeleteUserGoalError
source: An error occurred while deleting the goal.
es: Ha ocurrido un error mientras se eliminaba la meta.

# InvalidUserGoalID
source: Invalid goal ID.
es: El ID de la meta no es válido.

# UserGoalNotFound
source: Goal not found.
es: Meta no encontrada.

# EditUserGoalSuccess
source: Goal edited successfully.
es: Meta editada exitosamente.

# EditUserGoalError
source: An error occurred while editing the goal.
es: Ha ocurrido un error mientras se editaba la meta.

# AddUserProgressSuccess
source: Progress added successfully.
es: El progreso ha sido agregado exitosamente.

# AddUserProgressError
source: An error occurred while adding the progress.
es: Ha ocurrido un error mientras se agregaba el progreso.

# AddWorkoutSuccess
source: Workout added successfully.
es: La rutina ha sido agregada exitosamente.

# AddWorkoutError
source: An error occurred while adding the workout.
es: Ha ocurrido un error mientras se agregada la rutina.

source: Invalid workout ID.
es: El ID de la rutina no es válido.

source: Workout not found.
es: Rutina no encontrada.

# DeleteWorkoutSuccess
source: Workout deleted successfully.
es: La rutina ha sido eliminada exitosamente.

# DeleteWorkoutError
source: An error occurred while deleting the workout.
es: Ha ocurrido un error mientras se eliminada la rutina.

# EditWorkoutSuccess
source: Workout updated successfully.
es: Rutina editaba exitosamente.

# EditWorkoutError
source: An error occurred while editing the workout.
es: Ha ocurrido un error mientras se editaba la rutina.

# Name50MaxLength
source: Name cannot be longer than 50 characters.
es: El nombre no puede tener más de 50 caracteres.

# Description500MaxLength
source: Description cannot be longer then 500 characters.
es: La descripción no puede tener más de 500 caracteres.

# GenderValidation
source: Gender must be Male of Female.
es: El genero debe ser Masculino o Femenino.

# HeightValidation
source: Height must be between 50 cm and 300 cm.
es: La altura debe estar entre 50 cm y 300 cm.

# TargetValuePositiveValidation
source: Target value must be greater than zero.
es: El valor objetivo debe ser mayor a cero.

# GoalDateValidation
source: The goal date must be in the future.
es: La fecha de la meta debe ser en el futuro.

# WeightValidation
source: Weight must be a positive number.
es: El peso debe ser mayor a cero

# MinExercisesValidation
source: At least one exercise must be included.
es: Al menos debe incluir un ejercicio.

# UniqueExercisesValidation
source: Exercises in a workout must be unique (no repetitions).
es: Los ejercicios en las rutinas deben ser únicos (sin repeticiones).

# RestTimeValidation
source: Rest time must be between 0 and 60 minutes.
es: El tiempo de descanso debe ser entra 0 y 60 minutos.

# MinSetsValidation
source: Sets must be at least 1.
es: Los sets deben ser al menos 1.

# MinRepetitionsValidation
source: Repetitions must be at least 1.
es: Las repeticiones deben ser al menos 1.

# Greetings
source: Hi
es: Hola

# Slogan
source: Always looking out for your physical and mental well-being
es: Siempre buscando tu bienestar físico y mental

# UserNotAuth
source: User not authenticated.
es: Usuario no autenticado.

# LoginSuccess
source: Login successful
es: Inicio de sesión exitoso.

# MissingRefreshToken
source: The refresh token was not sent.
es: El token de refresco no fue enviado.

# RefreshSuccess
source: Refresh process successfully completed.
es: Proceso de refresco realizado con éxito.
